Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: །ཀླུའི་བདག་པོ་ད་དུང་ཡང་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་འོག་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་ན་དགེ་སློང་སྡིག་ཅན་རྣམས་དང་། དགེ་སློང་མ་སྡིག་ཅན་རྣམས་དང་། དགེ་བསྙེན་སྡིག་ཅན་རྣམས་དང་། དགེ་བསྙེན་མ་སྡིག་ཅན་རྣམས་ཚུལ་ཁྲིམས་ཉམས་པས་ཀླུའི་སྐྱེ་གནས་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རོ།
en: Still, Nāga Lord, in the latter days after I have passed into parinirvāṇa, evil monks, nuns, laymen, and laywomen will let their discipline degenerate and therefore be reborn in the nāga realms.

source: །དེའི་ནང་ནས་ཁ་ཅིག་ནི་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་ལྟུང་བར་འགྱུར་རོ། །གསོལ་པ།
en: Some among them will fall to the state of hell beings.”

source: བཅོམ་ལྡན་འདས་རབ་ཏུ་བྱུང་བར་གཏོགས་ལ་ཚུལ་ཁྲིམས་ཉམས་པ་ཀླུའི་སྐྱེ་གནས་རྣམས་སུ་སྐྱེས་པ་དང་། སྐྱེ་བར་འགྱུར་བ་གང་ལགས་པ་དེ་དག་གི་ལས་རྣམས་ལ་ཁྱད་པར་ཅི་མཆིས་ལགས།
en: Nāga King Sāgara asked, “Blessed One, what is notable about the actions of those who have gone forth who let their discipline degenerate and either have been or will be reborn in the nāga realms?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་རབ་ཏུ་འབྱུང་བར་གཏོགས་ལ་ཚུལ་ཁྲིམས་ཉམས་པ་ཀླུའི་སྐྱེ་གནས་རྣམས་སུ་སྐྱེས་པ་དང་། སྐྱེ་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་དག་གི་སྦྱོར་བ་ནི་ཡོངས་སུ་མ་དག་ལ།
en: The Blessed One answered, “Nāga Lord, the behavior of those who have gone forth who let their discipline degenerate and either have been or will be reborn in the nāga realms is extremely impure.

source: དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་ཡིད་ཆེས་པའི་ཕྱིར་དེ་དག་གི་བསམ་པ་ནི་ཡོད་དེ། དེ་དག་ནི་ཀླུའི་སྐྱེ་གནས་དེ་ནས་ཤི་འཕོས་ནས་ལྷག་པའི་བསམ་པ་དེའི་སྟོབས་ཀྱིས་ལྷ་དང་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: But, because they have trust in the Thus-Gone One’s teachings, they have the motivation such that when they pass on from the nāga realm they will be reborn among the gods and humans due to the power of that pure motivation.

source: བསྐལ་པ་བཟང་པོ་འདི་ལ་སངས་རྒྱས་སུ་འགྱུར་བ་གང་ཡིན་པ་དེའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་བསྟན་པ་ལ་ཐེག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མོས་པར་འགྱུར་ཏེ།
en: They will have the inclination to enter the vehicles within the teachings of those thus-gone ones who become buddhas in this Fortunate Eon.

source: ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པ་རྣམས་མ་གཏོགས་པར་ཐམས་ཅད་ཀྱང་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: All of them, except for those who have entered the Great Vehicle, will pass into parinirvāṇa during this Fortunate Eon.

source: །ཀླུའི་བདག་པོ་དེ་བཞིན་གཤེགས་པའི་བསྟན་པའི་ཆེ་བ་ཉིད་དང་། རབ་ཏུ་བྱུང་བའི་ཡོན་ཏན་གྱི་རྒྱུའི་ཁྱད་པར་ལ་ལྟོས།
en: “Nāga Lord, consider thus the uniqueness of the cause, which is the greatness of the Thus-Gone One’s teachings and the benefits of renunciation.

source: འདི་ལྟར་སེམས་ཅན་དེ་དག་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤངས་ནས་ཁྱད་པར་དུ་འགྲོ་བར་འགྱུར་རོ།
en: Due to this cause, these beings will abandon all nonvirtuous qualities and become extraordinary.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་བུ་དཔལ་གྱི་གཟི་བརྗིད་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མཐོང་བ་དང་ཐོས་པ་དོན་མཆིས་པ་ལགས་ཏེ་ངོ་མཚར་ལགས་སོ།
en: Then Glorious Splendor, the son of the Nāga King Sāgara, said to the Blessed One, “Blessed One, it is incredible how meaningful it is to see and hear the blessed buddhas.

source: །འདི་ལྟར་སྨད་དུ་མ་མཆིས་པའི་ལས་ཅན་རྣམས་ཀྱིས་སངས་རྒྱས་ལ་དམིགས་པའི་སེམས་གཅིག་ཙམ་བསྐྱེད་པ་ཡང་ཆབ་འཚལ་བར་མི་འགྱུར་ཏེ། དེ་ནི་དེ་དག་གི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་རྒྱུར་འགྱུར་བ་ལགས་སོ།
en: In this way, if such worthy beings who have a karmic connection arouse the mind focused on the Buddha even one time and do not let that thought spoil, it will become a cause for obtaining parinirvāṇa.

source: །བཅོམ་ལྡན་འདས་བདག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ལྟ་སྟེ། མཐོང་བ་དང་ཐོས་པའི་དོན་མཆིས་པར་སེམས་བསྐྱེད་པར་འཚལ་ལོ།
en: Blessed One, I will also seek unsurpassed and perfect awakening by arousing the intention to see and hear in the same way.

source: །བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་གི་བར་དུ་བདག་གི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དོན་མཆིས་པར་གྱུར་ཅིག །བདག་སེམས་རྨོངས་པར་མ་གྱུར་ཅིག །དགེ་བ་ལ་རྨོངས་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ལ་རྨོངས་པར་མ་གྱུར་ཅིག །བདག་ཚེ་རབས་ཐམས་ཅད་དུ་སངས་རྒྱས་མཐོང་བ་དང་། ཆོས་ཐོས་པ་དང་། འཕགས་པའི་དགེ་འདུན་ལ་བསྙེན་བཀུར་བགྱིད་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་དང་འབྲལ་བར་མ་གྱུར་ཅིག །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་བུ་དཔལ་གྱི་གཟི་བརྗིད་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། བཞིན་བཟངས་ཁྱོད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྟེན་གྱི་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ།
en: Until I reach the seat of awakening, may my bodhisattva conduct be meaningful. May I not become deluded. May I not become deluded about virtue or about great love and compassion. In all my lifetimes, may I never be separated from seeing the buddhas, hearing the Dharma, serving the saṅgha of noble beings, and ripening beings.” The Blessed One then offered his approval to Glorious Splendor, the son of the Nāga King Sāgara, “Good sir, it is excellent that you have developed an attitude of supporting all beings.

source: །འདི་ལྟ་བུའི་ལྷག་པའི་བསམ་པ་དང་། འདི་ལྟ་བུའི་སྙིང་རྗེ་ཆེན་པོས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་འདིའི་དགེ་བའི་རྩ་བའི་རྣམ་པར་སྨིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པས་ལོ་བདུན་དང་། ཟླ་བ་བདུན་དང་། ཞག་བདུན་དུ་བཤད་ཀྱང་མཐར་ཕྱིན་པར་བཤད་པར་མི་སྤྱོད་དེ།
en: Even if the blessed ones were to describe them for seven years, seven months, and seven days, they would be unable to describe the ripening of the roots of virtue of developing the mind set on awakening with this kind of pure motivation and great compassion.

source: ཁྱོད་ཀྱིས་དགེ་བའི་རྩ་བའི་ཚོགས་དེ་ཙམ་དུ་ཚད་མེད་པ་འདི་ཡོངས་སུ་བཟུང་ངོ་།
en: So, the roots of virtue that you have accumulated should be understood as being that limitless.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་བུ་དཔལ་གྱི་གཟི་བརྗིད་ཀྱི་ལྷག་པའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་དེའི་ཚེ་འཛུམ་པ་མཛད་དོ།
en: The Blessed One smiled when he recognized the pure motivation of Glorious Splendor, the son of the Nāga King Sāgara.

source: །འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གང་གི་ཚེ་འཛུམ་པ་མཛད་པའི་ཆོས་ཉིད་དེ། དེ་ནས་དེའི་མོད་ལ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཁ་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་ངོ་།
en: It is in the nature of the blessed buddhas that whenever they smile, in that very moment, blue, yellow, red, white, crimson, crystal, and silver-colored light streams from the mouths of those blessed ones.

source: །འོད་ཟེར་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་བྱས་ནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་མངོན་པར་འཕགས་ཏེ། ཉི་མ་དང་ཟླ་བ་གཉིས་ཀྱི་གཟི་བརྗིད་དང་། འོད་ཀྱང་མོག་མོག་པོར་བྱས་ནས་ཕྱིར་ལོག་སྟེ།
en: This light pervades limitless worlds with bright light, rising as high as the Brahmā world and eclipsing even the splendor and brightness of the sun and moon.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས།
en: The light then returns and encircles the blessed ones three times before it dissolves into a blessed one’s crown.

source: བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་པར་གྱུར་ཏོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: Then Venerable Ānanda stood up, draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འཛུམ་པ་མཛད་པའི་དོན་ཚིགས་སུ་བཅད་པས་ཞུས་པ།
en: With his palms together he bowed toward the Blessed One and asked the Blessed One the meaning of his smile in verse:

source: བདེ་གཤེགས་བསོད་ནམས་བརྒྱས་སྤྲས་སྐུ་མངའ་བ།
en: “O Well-Gone One whose body is adorned with myriad merits

source: །མཚན་མཆོག་སུམ་ཅུ་རྩ་གཉིས་ལྡན་པའི་སྐུ།
en: And possesses the thirty-two supreme marks—

source: །ཟླ་བ་ལྟ་བུར་དྲི་མེད་དག་པའི་ཞལ།
en: Your face is pure and immaculate like the moon.

source: །ཅི་ཡི་སླད་དུ་འཛུམ་པ་སྟོན་པར་མཛད།
en: Why have you shown your smile?

source: །བཅོམ་ལྡན་དྲི་མེད་དྲི་མ་གསུམ་བྲལ་བ།
en: “O Blessed One, you are immaculate, devoid of the three stains.

source: །ཐ་བ་མི་མངའ་རྣམ་དག་པད་མའི་སྤྱན།
en: Without affliction, your lotus eyes are utterly pure.

source: །ལྷ་དང་ལྷ་མ་ཡིན་དང་ཀླུས་མཆོད་པ།
en: You are venerated by gods, asuras, and nāgas.

source: །བཅོམ་ལྡན་ཚེམས་སྙོམས་ཐགས་བཟང་དཀར་བར་ལྡན།
en: “O Blessed One, your teeth are even, straight, and brilliantly white.

source: །སྟོབས་བཅུ་མངའ་ཞིང་དྲི་བསུང་གདའ་བའི་ཞལ།
en: You master the ten powers, and your mouth has the most pleasant breath.

source: །རྒ་དང་འཆི་བའི་མཐར་ཐུག་མཛད་པ་པོ།
en: O surmounter of aging and death,

source: །ནམ་མཁའི་དཀྱིལ་ལྟར་དྲི་མ་མེད་པའི་ཐུགས།
en: “O protector whose mind is immaculate like the sphere of space,

source: །མགོན་པོ་ཐུགས་ཀྱིས་དགྲ་ཟིན་མཉམ་སྙོམས་པ།
en: With your heart you see enemies in equality.

source: །ཐུགས་ནི་རི་བོ་ལྟ་བུར་མི་གཡོ་བ།
en: Your mind is unmoving like a mountain.

source: །བཅོམ་ལྡན་འཛུམ་པའི་དོན་འདིར་བཀའ་སྩལ་གསོལ།
en: Blessed One, please elucidate the meaning of your smile!

source: །བཅོམ་ལྡན་ཚངས་པའི་སྒྲ་སྐད་སྒྲོགས་པ་པོ།
en: “O Blessed One, you speak with Brahmā’s voice,

source: །མིའམ་ཅི་དང་ཀ་ལ་པིང་ཀ་དང་། །རྔ་སྒྲ་ལྟ་བུར་སྙན་ཅིང་དགའ་བ་དང་། །མཉེན་པོར་གསུང་བ་འཛུམ་པའི་ཐབས་གསུངས་ཤིག །འདྲེན་པ་ཐོགས་པ་མེད་པའི་བློ་མངའ་བ།
en: Which is pleasing and delightful like the sound Of a kinnara, a cuckoo, or a drum. Please speak to the means of your smile! “O guide, possessing the unimpeded mind,

source: །དུས་གསུམ་འགྲོ་བའི་སྤྱོད་དང་མོས་པ་དང་། །དབང་པོ་རྣམས་ཀྱང་རབ་ཏུ་མཁྱེན་པ་པོ།
en: You know the actions, the hopes, and even the faculties of beings Throughout the three times.

source: །བཅོམ་ལྡན་སྨན་པའི་རྒྱལ་པོ་མི་རྣམས་དང་། །ལྷ་ཀླུ་རྣམས་ཀྱི་ནད་ནི་ཞི་མཛད་པ།
en: “O Blessed One, king of physicians, You heal the diseases of humans, gods, and nāgas.

source: །བཅོམ་ལྡན་གཏན་དུ་བདེ་བ་སྟོན་པ་པོ།
en: O Blessed One, teacher of lasting bliss,

source: །ཡོན་ཏན་མངའ་བ་བདག་ལ་བཀའ་སྩོལ་ཅིག །ལྷ་དང་མི་རྣམས་ཁྲག་ཁྲིག་ཉན་ཅིང་མཆིས།
en: Billions of gods and humans are here, listening.

source: །ཐོས་ནས་ཡིད་ནི་རབ་ཏུ་དགའ་འགྱུར་ཞིང་།
en: Hearing, their minds will be totally gladdened,

source: །ཐམས་ཅད་མཁྱེན་པའི་དགོངས་པ་བགྱིད་པར་འགྱུར།
en: And the intention of the omniscient one will be enacted.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཀླུའི་རྒྱལ་པོའི་བུ་དཔལ་གྱི་གཟི་བརྗིད་ངའི་མདུན་དུ་འདུག་ནས་ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་འདི་མཐོང་ངམ།
en: The Blessed One asked Venerable Ānanda, “Ānanda, did you see Glorious Splendor, son of the Nāga King, standing before me while through his pure motivation he developed the mind set on unsurpassed and perfect awakening?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ།
en: “Yes, Blessed One, I did see it.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དཔལ་གྱི་གཟི་བརྗིད་འདི་ནི་བསྐལ་པ་གྲངས་མེད་པ་ཕྲག་བརྒྱད་བརྒྱན། བསྐལ་པ་ཀུན་ཏུ་ལྟ་བ་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་དག་ཅིང་བརྟེན་པར་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དོན་ཡོད་ཅེས་བྱ་བར་འགྱུར་ཏེ། འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The Blessed One said, “Ānanda, in eight hundred countless eons, during the eon Total Vision, Glorious Splendor will become the Thus-Gone One Amoghadarśin, appearing in the world Totally Pure and Stable.

source: །ཀུན་དགའ་བོ་དཔལ་གྱི་གཟི་བརྗིད་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་དོན་ཡོད་པ་སྤྱོད་ཅིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་པ་མཉེས་པར་བྱས་ཏེ།
en: Ānanda, Glorious Splendor has engaged in the meaningful conduct of bodhisattvas and pleased limitless blessed buddhas.

source: མཆོད་པར་བྱས་ནས་རབ་ཏུ་འབྱུང་སྟེ། ཚངས་པར་སྤྱོད་པར་འགྱུར་རོ།
en: Venerating them, he went forth and engaged in pure conduct.

source: །སེམས་ཅན་ཚད་མེད་པ་ཡང་ཐེག་པ་གསུམ་གྱིས་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ཡིན་ནོ།
en: He ripened limitless beings through the three vehicles.

source: །ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དོན་ཡོད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་དག་ཅིང་བརྟེན་པ་དེ་ཡང་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། ཉམས་དགའ་བར་འགྱུར་ལ།
en: Ānanda, Totally Pure and Stable, the world of the Thus-Gone One Amoghadarśin, will be wealthy, extensive, blissful, and pleasant, and it will have good harvests.

source: སྐྱེ་བོ་མང་པོ་དང་། ལྷ་དང་། མི་རྣམས་ཀྱིས་གང་བར་འགྱུར་ཏེ།
en: It will have a huge population and be filled with gods and humans.

source: དཔེར་ན་འཐབ་བྲལ་གྱི་ལྷ་རྣམས་ཀྱི་ཉེ་བར་སྤྱད་པ་དང་། ལོངས་སྤྱོད་ཇི་ལྟ་བ་བཞིན་དུ་དེ་ན་མི་རྣམས་ཀྱི་ཡང་དེ་དང་འདྲ་བར་འགྱུར་རོ།
en: The humans there will be similar to the gods of the Heaven Free from Strife in their provisions and enjoyments.

source: །དེ་བཞིན་གཤེགས་པ་དེའི་ཚེའི་ཚད་ཀྱང་ལོ་ཁྲི་ཐུབ་པར་འགྱུར་རོ།
en: The lifespan of this thus-gone one will reach ten thousand years.

source: །དེའི་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ནི་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ཡོད་དོ།
en: His saṅgha of hearers will be six hundred million strong.

source: །བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ནི་འབུམ་ཕྲག་བཅུ་གཉིས་འདུ་བར་འགྱུར་རོ།
en: His saṅgha of bodhisattvas will number one million two hundred thousand.

source: །ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དོན་ཡོད་དེ་སེམས་ཅན་གང་དག་གི་མིག་སྔར་སྣང་བ་དེ་དག་ཀྱང་མཐོང་བའི་མོད་ལ་བྱམས་པའི་རྣམ་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་རོ།
en: “Ānanda, as soon as the Thus-Gone One Amoghadarśin enters these beings’ field of vision, they will achieve the meditative absorption features of love

source: །ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དོན་ཡོད་ནི་མཐོང་བའི་མོད་ལ་སེམས་ཅན་རྣམས་འདུལ་བར་འགྱུར་རོ།
en: Ānanda, as soon as beings see the Thus-Gone One Amoghadarśin, they will be tamed.

source: །དེ་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པར་གྱུར་པ་གང་དག་ཡིན་པ་དེ་དག་ནི་དང་པོ་མཐོང་བས་རྒྱུན་དུ་ཞུགས་པར་འགྱུར་རོ།
en: Regarding this, anyone on the vehicle of hearers will, upon seeing him for the first time, become a stream enterer.

source: །ལན་གཉིས་མཐོང་བས་ནི་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཐོབ་པར་འགྱུར་རོ།
en: Upon seeing him for the second time, they will achieve the fruit of a once-returner.

source: །ལན་གསུམ་མཐོང་བས་ནི་ཕྱིར་མི་ལྡོག་པའི་འབྲས་བུ་ཐོབ་པར་འགྱུར་རོ།
en: Upon seeing him for the third time, they will achieve the fruit of a non-returner.

source: །ལན་བཞི་མཐོང་བས་ནི་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་པར་འགྱུར་རོ།
en: Upon seeing him for the fourth time, they will achieve the state of a worthy one.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པར་གྱུར་པ་གང་དག་ཡིན་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དོན་ཡོད་དེ་མཐོང་བའི་མོད་ཁོ་ན་ལ་མི་སྐྱེ་བའི་ཆོས་རྣམས་ལ་བཟོད་པ་ཐོབ་པར་འགྱུར་རོ།
en: Anyone on the vehicle of bodhisattvas will, upon purely seeing him for the first time, attain the acceptance that phenomena are unborn.

source: །ཀུན་དགའ་བོ་འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་དག་ཅིང་བརྟེན་པ་ནི་སེམས་ཅན་སུ་ཡང་ཚུལ་ཁྲིམས་ཉམས་པའམ། ལྟ་བ་ཉམས་པའམ། ཆོ་ག་ཉམས་པའམ། འཚོ་བ་ཉམས་པར་མི་འགྱུར་ཏེ།
en: “Ānanda, no beings in the world Totally Pure and Stable will ever let their discipline, view, activity, or livelihood degenerate.

source: དེ་དག་ཐམས་ཅད་ཡང་དག་པ་ཉིད་དུ་ངེས་པར་འགྱུར་རོ།
en: They will all become certain about what is correct.

source: །སེམས་ཅན་དེ་ནས་ཤི་འཕོས་པ་སུ་ཡང་ངན་འགྲོར་འགྲོ་བར་མི་འགྱུར་ཏེ།
en: No beings who die will be reborn in the lower realms;

source: དེ་དག་ཐམས་ཅད་ལྷ་དང་མི་རྣམས་ཀྱི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དག་ཏུ་ཡང་སྐྱེ་བར་འགྱུར་རོ།
en: instead they will all be reborn among the humans and gods or into pure buddha realms.”

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་བུ་དཔལ་གྱི་གཟི་བརྗིད་ཀྱིས་བདག་ཉིད་ལུང་བསྟན་པ་ཐོས་ནས། ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ་རབ་ཏུ་དགའ་ནས་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: When Glorious Splendor, the son of the Nāga King Sāgara, heard this prophecy himself, he was satisfied, happy, delighted, joyful, and at ease.

source: མུ་ཏིག་གི་དྲ་བ་ནོར་བུ་རིན་པོ་ཆེ་འབུམ་གྱིས་སྤྲས་པ། དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་གསོལ་ནས་སོར་མོ་བཅུའི་ཐལ་མོ་སྦྱར་ཏེ། མངོན་སུམ་དུ་བཅོམ་ལྡན་འདས་ལ་ཚུལ་དང་འཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་པ།
en: Presenting a net of pearls adorned with hundreds of thousands of precious gems to the body of the Thus-Gone One, he pressed his ten fingers and palms together and praised the Blessed One directly with these fitting verses:

source: མི་དབང་ཟླ་བ་དྲི་མེད་འོད་ཀྱི་ཞལ།
en: “Lord of Humans, your face shines like immaculate moonlight.

source: །གཟི་བརྗིད་མཐའ་ཡས་ལྷ་དང་མིས་མཆོད་པ།
en: Infinite splendor, venerated by the gods and humans,

source: །མཚུངས་མེད་སྟོབས་ལྡན་མཐའ་ཡས་ཤུགས་མངའ་བ།
en: Incomparable strength, infinite power—

source: །ཡེ་ཤེས་ཚད་མ་མཆིས་ལ་མགོས་ཕྱག་འཚལ།
en: I bow my head to you, immeasurable wisdom!

source: །ཕན་པར་མཛད་པའི་ཡེ་ཤེས་ཚད་མ་མཆིས།
en: “O immeasurable wisdom that benefits all,

source: །དེ་བཞིན་ཤེས་རབ་འོད་ཀྱང་བསམ་མི་ཁྱབ།
en: Whose insight, likewise, is unfathomable,

source: །ཚུལ་ཁྲིམས་དྲི་མེད་རབ་བརྟན་རྣམ་པར་དག །མི་དབང་མཁའ་དཀྱིལ་འདྲ་ལ་ཕྱག་འཚལ་ལོ།
en: With discipline immaculate, firm, and pure— I prostrate to you, Lord of Humans, who are like the sphere of space!

source: །བསྐལ་པ་དཔག་ཏུ་མེད་པ་མཐའ་ཡས་པར།
en: “Engaging in practices for countless infinite eons,

source: །སྤྱོད་པ་སྤྱད་ནས་སངས་རྒྱས་ཡེ་ཤེས་བརྙེས།
en: You attained the wisdom of buddhahood.

source: །དེས་ན་འགྲོ་བའི་སྤྱོད་པ་རབ་ཏུ་མཁྱེན།
en: Thereby, you know the behavior of beings

source: །དེ་བཞིན་དེ་དག་དབང་པོ་བསམ་པ་མཁྱེན།
en: And likewise their faculties and thoughts.

source: །འཇིག་རྟེན་བཅོམ་ལྡན་གཟུགས་དང་མཚུངས་མ་མཆིས།
en: “O Blessed One, your form is incomparable in the world,

source: །དེ་ཕྱིར་འགྲོ་བ་ལྟ་བས་ཆོག་མ་འཚལ།
en: And beings therefore never grow satisfied in beholding you.

source: །དེ་ཡི་ཉོན་མོངས་སྐྱེ་བར་མི་འགྱུར་ཞིང་།
en: Their afflictions are prevented from arising,

source: །དེ་ཚེ་ཉོན་མོངས་ཐམས་ཅད་རབ་ཏུ་ཞི།
en: And in that moment all are quelled.

source: །ཀ་ལ་པིང་ཀ་ཁུ་བྱུག་མིའམ་ཅི།
en: “The calls of the kalaviṅka and cuckoo, the music of the kinnaras,

source: །དེ་བཞིན་ཚངས་པའི་སྒྲ་དང་ལྷ་མིན་སྒྲ།
en: And likewise the sounds of Brahmā and the asuras—

source: །ཕྱོགས་བཅུ་དག་ན་ཡིད་འོང་སྒྲ་དེ་དག །བདེ་གཤེགས་གསུང་གཅིག་གིས་ནི་ཟིལ་གྱིས་མནན།
en: Any such pleasing sound heard in the ten directions Is outclassed by the single voice of the Well-Gone One.

source: །མཁའ་ལས་ཟླ་བ་ས་ལ་ལྷུང་ཡང་གདའ།
en: “It’s possible the moon could fall from the sky.

source: །རྒྱ་མཚོ་སྐམས་ཤིང་རི་རབ་སྙིལ་ཡང་གདའ།
en: It’s possible the ocean could dry up and Mount Meru be reduced to dust.

source: །ས་ལ་གནམ་ལྷུང་དུམ་བུ་བརྒྱར་འགྱུར་གདའ།
en: It’s possible the sky could fall to the earth and shatter into a hundred pieces.

source: །རྒྱལ་བའི་བཀའ་ནི་གཞན་དུ་ཡོང་མི་གསུང་།
en: But nothing, on the other hand, could happen to the Victor’s voice.

source: །བདེན་པའི་བརྟུལ་ཞུགས་རབ་འབྲེལ་སྟོན་པས་འདིར།
en: “Observing the conduct of truth, the Teacher has

source: །སངས་རྒྱས་ཡེ་ཤེས་གཙོ་བོས་བདག་ལུང་བསྟན།
en: Granted me prophecy guided by awakened wisdom. I have no doubt, hesitation, or skepticism about whether

source: །བདག་ནི་རྒྱལ་བ་རང་བྱུང་ཡོན་གནས་འགྱུར། །བདག་ལ་ཡིད་གཉིས་སོམ་ཉི་དོགས་མ་མཆིས།
en: I will become a self-arisen victor, the embodiment of qualities.

source: །ཕྱོགས་བཅུ་དག་ཏུ་རིན་ཆེན་ལེགས་སྤྲས་པ།
en: “One could finely decorate the ten directions with countless billions of jewels

source: །བྱེ་བ་མཐའ་ཡས་འདྲེན་པ་རྣམས་ལ་ཕུལ། །བྱང་ཆུབ་སེམས་གཅིག་བསྐྱེད་པ་གང་ལགས་ལ།
en: And offer them to the guides.

source: །བསོད་ནམས་སྔ་མས་འདི་ཡི་ཆར་མི་ཕོད།
en: But the merit of this would not equal even a fraction

source: །གང་ཞིག་བྱང་ཆུབ་སེམས་མཆོག་བསྐྱེད་པར་བགྱི།
en: Of that of arousing the mind set on awakening just once. “Those who develop the supreme mind set on awakening

source: །དེས་ན་སངས་རྒྱས་མཆོད་པ་མཆོག་ཏུ་འཕགས།
en: Elevate their veneration of the buddhas to the highest degree.

source: །གང་ཞིག་འདྲེན་རྣམས་ཚུལ་འདི་མི་གཅོད་པ།
en: One who does not interrupt this mode of the guides

source: །དེ་ནི་སྟོབས་བཅུ་ཀུན་གྱི་བཀའ་དྲིན་གཟོ།
en: Will repay the kindness of the ten powers.”

source: །ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་བུ་དཔལ་གྱི་གཟི་བརྗིད་དེས་ཚིགས་སུ་བཅད་པ་མངོན་པར་བསྒྲུབ་པ་འདི་སྨྲས་པ་ན། སྲོག་ཆགས་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: When Glorious Splendor, son of the Nāga King Sāgara, spoke these consummate verses, ten thousand beings developed the mind set on unsurpassed and perfect awakening.

source: དེ་དག་གིས་ཚིག་འདི་སྐད་དུ་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དོན་ཡོད་དེས་བྱང་ཆུབ་བརྙེས་པ་དེའི་ཚེ། བདག་ཅག་ཀྱང་བཅོམ་ལྡན་འདས་དང་ཕྲད་དེ།
en: They announced, “When the Blessed Thus-Gone One Amoghadarśin attains awakening, may we meet this blessed one and be reborn in the world Totally Pure and Stable.

source: འཇིག་རྟེན་གྱི་ཁམས་ཡོངས་སུ་དག་ཅིང་བརྟན་པ་དེར་སྐྱེ་བར་གྱུར་ཅིག །དེ་བཞིན་གཤེགས་པ་དེའི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་ཅིང་མཆོད་པ་དང་། བསྙེན་བཀུར་ཡང་བགྱིད་པར་གྱུར་ཅིག །བཅོམ་ལྡན་འདས་དེའི་འོག་ཏུ་བདག་ཅག་ཀྱང་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག་ཅེས་ཀྱང་སྨྲས་སོ།
en: May we uphold the sublime Dharma of that thus-gone one, venerate him, and serve him. Following that blessed one, may we also fully awaken.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དེ་དག་ཐམས་ཅད་འཇིག་རྟེན་གྱི་ཁམས་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དོན་ཡོད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་ལུང་བསྟན་ཏོ།
en: The Blessed One then gave the prophecy that all of them would be reborn in the buddha realm of the Thus-Gone One Amoghadarśin.

source: །ལུང་བསྟན་པའི་ལེའུ་སྟེ་ལྔ་པའོ།།
en: Chapter Five: Prophecy

source: །།དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ཅག་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་མང་པོ་ལ་སྨན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་རྒྱ་མཚོ་ཆེན་པོར་སང་གདུགས་ཚོད་གསོལ་བར་གནང་བར་མཛད་དུ་གསོལ། དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Nāga King Sāgara then said to the Blessed One, “Blessed One, out of care for us, to benefit many beings, to bring many beings happiness, and out of love for the world, I beg you to take tomorrow’s midday meal in the ocean.

source: བཅོམ་ལྡན་འདས་རྒྱ་མཚོ་ཆེན་པོའི་ནང་ན་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། དེ་མ་ལགས་པར་ཡང་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་པའི་སེམས་ཅན་ཚད་མ་མཆིས་པ་དག་མཆིས་ཏེ།
en: Blessed One, the ocean is home to limitless beings such as gods, nāgas, yakṣas, gandharvas, asuras, and other species of animals.

source: དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་ན་དགེ་བའི་རྩ་བ་དག་བསྐྱེད་པར་འགྱུར་ལ།
en: If they see the Thus-Gone One, they will develop roots of virtue.

source: དམ་པའི་ཆོས་ཐོས་པས་ཀྱང་འཁོར་བ་ཐོག་མ་མ་མཆིས་པའི་མཐའ་རྟོགས་པར་འགྱུར་བ་དང་། བདག་གི་ཀླུའི་རྒྱལ་པོའི་གནས་ཀྱང་ཡོངས་སུ་ལོངས་སྤྱད་པར་འགྱུར་ཏེ།
en: By hearing the sublime Dharma, they will comprehend how there can be an end to beginningless saṃsāra.

source: ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་བརྙས་པར་མི་འགྱུར་ལ།
en: My royal nāga realm will flourish, and the world and its gods will be unable to defeat us.

source: དེ་བཞིན་གཤེགས་པས་ཀྱང་སངས་རྒྱས་ཀྱི་ཆེ་བ་ཉིད་བསྟན་པར་འགྱུར་བ་དང་། བདག་གི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་དང་ལྡན་པའི་ཆོས་ཉེ་བར་བསྟན་པ་བགྱིས་པར་འགྱུར་བའི་སླད་དུའོ།
en: In this way, the Thus-Gone One could demonstrate the eminence of the buddhas and explain the Dharma that describes the factors of awakening in relation to me.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་ཐུགས་བརྩེ་བ་དང་། སེམས་ཅན་ཚད་མེད་པ་དག་གི་དགེ་བའི་རྩ་བ་འཕེལ་བར་བྱ་བའི་ཕྱིར་གནང་ངོ་།
en: The Blessed One accepted this request out of his love for Nāga King Sāgara and in order to amplify the roots of virtue of limitless beings.

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་བཅོམ་ལྡན་འདས་ཀྱིས་གནང་བར་རིག་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ། རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: Seeing that the Blessed One had approved his request, Nāga King Sāgara was satisfied, pleased, delighted, overjoyed, and at ease. He bowed his head to the Blessed One’s feet and circumambulated him three times.

source: དཔུང་དང་བཅས། འཁོར་དང་བཅས་པར་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་ནས་མི་སྣང་བར་གྱུར་ཏེ་རྒྱ་མཚོའི་ནང་དུ་ཕྱིར་སོང་ངོ་།
en: With his supporters and retinue, he disappeared from before the Blessed One and returned to the ocean.

source: །དེ་ནས་དེར་སྐྱེ་བོའི་ཚོགས་འདུས་པ་ཐམས་ཅད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བདག་གིས་དེ་བཞིན་གཤེགས་པ་སང་གདུགས་ཚོད་གསོལ་བར་སྤྱན་དྲངས་ཏེ།
en: He addressed the mass of beings assembled in the ocean, “I have invited the Thus-Gone One to take tomorrow’s midday meal here.
